Revit 2027 API
BuiltInFailures.SiteFailures.BuildingPadNotConnected Property
 Can't create a single Pad with several connected regions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BuildingPadNotConnected { get; }
Public Shared ReadOnly Property BuildingPadNotConnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BuildingPadNotConnected {
	FailureDefinitionId^ get ();
}
static member BuildingPadNotConnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace